# encoding: UTF-8
require 'spec_helper'
require_relative '../lib/file_encoder.rb'

describe FileEncoder do
  it 'just works' do
    filename_to_encode = 'spec/fixtures/itemlist.txt'
    filename_to_save = 'tmp/itemlist.txt'
    old_encoding = 'CP850'

    expected_content = [
      "\"00000920\";\"POKI - LÍTILL\";\"POKI - LÍTILL\";\"POKI - LÍTILL\";\"19\";\"192\";\"1921\";\" \";\"\";\"23.816\";\"23.813\";\"0\";\"3\";\"0\";\"30\";\"0\";\"0\";\"23.813\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00011013\";\"LACK WLL SHLF 190X26 WHITE\";\"LACK VEGGHILLA 190 HVÍTT\";\"LACK veggh. 190x26 hvítt\";\"02\";\"021\";\"0215\";\"O\";\"2\";\"4\";\"0\";\"0\";\"4\";\"0\";\"3.990\";\"6,6\";\"0,0247\";\"-1\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00011428\";\"GRUNDTAL WLL SHLF 80 STAINLESS STEEL\";\"GRUNDTAL VEGGHILLA 80 RYÐFR.STÁL\";\"GRUNDTAL veggh. 80 ryðfrítt stál\";\"07\";\"076\";\"0762\";\"O\";\"1\";\"25\";\"25\";\"0\";\"0\";\"0\";\"4.990\";\"2,08\";\"0,00387\";\"20\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00011536\";\"GRUNDTAL S-HOOK 11 STAINLESS STEEL 5-P\";\"GRUNDTAL KRÓKUR 11  RYÐFR.STÁL 5-P\";\"GRUNDTAL krókur, s-laga 11 ryðfrítt stál 5stk\";\"07\";\"076\";\"0762\";\"O\";\"4\";\"106\";\"102\";\"0\";\"0\";\"0\";\"595\";\"0,235\";\"0,00087\";\"97\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00015134\";\"SVALKA WHI WNE GLS 25 CL CLEAR GLASS 6-P\";\"SVALKA HVÍTVÍNSGLAS 21 CL 6-P\";\"SVALKA hvítv.gl 25 cl glært gler 6stk\";\"15\";\"152\";\"1521\";\"O\";\"2\";\"66\";\"64\";\"0\";\"2\";\"0\";\"895\";\"0,8\";\"0,00661\";\"54\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00017133\";\"VASEN VASE 20 CLEAR GLASS\";\"VASEN VASI 20 CL GLER\";\"VASEN bl.vasi 20 glært gler\";\"16\";\"163\";\"1633\";\"K\";\"3\";\"274\";\"274\";\"0\";\"0\";\"0\";\"395\";\"0,739\";\"0,00449\";\"264\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00018076\";\"NIVA FLOOR LNING 3 MM 15.00M▓\";\"NIVA FLOOR LNING 3 MM POLYETHYLENE\";\"NIVÅ undirlag fyrir parket 3 mm 15.00m²\";\"20\";\"201\";\"2012\";\"O\";\"4\";\"0\";\"0\";\"0\";\"0\";\"0\";\"2.990\";\"1,31\";\"0,06643\";\"-5\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00026707\";\"ENJE RLLER BLIND 120X250 WHITE\";\"ENJE RÚLLUGARDÍNA 120X250 HVÍTT\";\"ENJE rúllugardína 120x250 hvítt\";\"12\";\"121\";\"1213\";\"K\";\"2\";\"48\";\"48\";\"0\";\"0\";\"0\";\"4.690\";\"1,38\";\"0,00396\";\"38\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00028508\";\"LEN N PILLOW COT 35X55 WHITE\";\"LEN N KODDI 35X55 HVÍTT\";\"LEN N koddi f/barnar. 35x55 hvítt\";\"09\";\"091\";\"0914\";\"O\";\"2\";\"370\";\"370\";\"0\";\"0\";\"0\";\"795\";\"0,17\";\"0,00215\";\"365\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00030196\";\"IKEA 365+ SIDE PLATE 18X18 BEIGE\";\"IKEA/365+ HLIÐARDISKUR 18X18 BEI\";\"IKEA 365+ hliðard 18x18 drappað\";\"15\";\"151\";\"1511\";\"K\";\"3\";\"11\";\"11\";\"0\";\"0\";\"0\";\"695\";\"0,32\";\"0,00041\";\"1\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00030262\";\"FORVAR JAR/LID 1,8 L GLASS/ALUMINIUM-COLOUR\";\"FÖRVAR KRUKKA 2,0 L ÁLLITAÐ\";\"FÖRVAR krukka/lok 1,8 l gler/állitt\";\"14\";\"143\";\"1432\";\"O\";\"4\";\"28\";\"28\";\"0\";\"0\";\"0\";\"495\";\"0,82\";\"0,00474\";\"18\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00030993\";\"GRANAT N CUSHION 50X50 WHITE\";\"GRANAT N PÚÐI 50X50 HVÍTT\";\"GRANAT N púði 50x50 hvítt\";\"12\";\"123\";\"1231\";\"O\";\"2\";\"342\";\"342\";\"0\";\"0\";\"0\";\"695\";\"0,37\";\"0,00457\";\"332\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00031841\";\"EDSVIK N KIT MX TP DUAL CHROME-PLATED\";\"EDSVIK N BLÖNDUNARTÆKI KRÓMHÚÐAÐ\";\"EDSVIK N blöndunart krómhúðað\";\"07\";\"075\";\"0751\";\"O\";\"4\";\"20\";\"16\";\"0\";\"2\";\"0\";\"10.950\";\"1,752\";\"0,0073\";\"11\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00034321\";\"TIDA DRAWER FRT 40X13 OAK\";\"ULRIKSDAL SKÚFFU.FRAMHL 40X13 EIK\";\"TIDA sk.fr. 40x13 eik\";\"07\";\"072\";\"0721\";\"O\";\"3\";\"13\";\"12\";\"0\";\"1\";\"0\";\"3.450\";\"0,665\";\"0,00099\";\"7\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n",
      "\"00035127\";\"HASTVEDA ACH RATTAN\";\"HÄSTVEDA HÆGINDASTÓLL BAST\";\"HÄSTVEDA stóll m/örmum bast\";\"01\";\"011\";\"0114\";\"O\";\"4\";\"15\";\"10\";\"0\";\"5\";\"0\";\"9.990\";\"4,37\";\"0,10785\";\"7\";\"0\";\"0\";\"\";\"\";\"01.10.12\";\"10:30:28\"\r\n"
    ]

    encoder = FileEncoder.new(filename_to_encode, filename_to_save, old_encoding)
    encoder.encode
    expect(File.readlines(filename_to_save)).to eq(expected_content)
  end

end
